src/ex_Tabakon/InformationRegisters/ТБК_Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТБК_Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБК_Штрихкоды/Ext/ManagerModule.bsl
Процедура СинхронизацияШтрихкодов()Экспорт
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	Штрихкоды.Штрихкод КАК Штрихкод,
	      	 	             |	Штрихкоды.Владелец КАК Владелец,
	      	 	             |	Штрихкоды.ТипШтрихкода КАК ТипШтрихкода,
	      	 	             |	Штрихкоды.Упаковка КАК Упаковка,
	      	 	             |	ЕСТЬNULL(ТБК_Штрихкоды.Штрихкод, 0) КАК Штрихкод1
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.Штрихкоды КАК Штрихкоды
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТБК_Штрихкоды КАК ТБК_Штрихкоды
	      	 	             |		ПО Штрихкоды.Штрихкод = ТБК_Штрихкоды.Штрихкод
	      	 	             |			И Штрихкоды.Владелец = ТБК_Штрихкоды.Владелец
	      	 	             |			И Штрихкоды.ТипШтрихкода = ТБК_Штрихкоды.ТипШтрихкода
	      	 	             |			И Штрихкоды.Упаковка = ТБК_Штрихкоды.Упаковка
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Итог.Штрихкод КАК Штрихкод,
	      	 	             |	Итог.Владелец КАК Владелец,
	      	 	             |	Итог.ТипШтрихкода КАК ТипШтрихкода,
	      	 	             |	Итог.Упаковка КАК Упаковка,
	      	 	             |	Итог.Штрихкод1 КАК Штрихкод1
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог
	      	 	             |ГДЕ
	      	 	             |	Итог.Штрихкод1 = 0
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	Итог.Штрихкод,
	      	 	             |	Итог.Владелец,
	      	 	             |	Итог.ТипШтрихкода,
	      	 	             |	Итог.Упаковка,
	      	 	             |	Итог.Штрихкод1");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из Рез цикл
		НоваяЗапись = РегистрыСведений.ТБК_Штрихкоды.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			
		КонецПопытки;		
	КонецЦикла;	
КонецПроцедуры
